#!/usr/bin/env python
# coding: utf-8

# In[1]:


import pandas


# In[2]:


# Создаем таблицу с данными о продуктах
products = {
    "Желатин": {"ед. измерения": "г", "цена за упаковку": 1161.00, "количество в упаковке": 1000.00, "цена за единицу": 1.16},
    "Сикао молочный": {"ед. измерения": "г", "цена за упаковку": 567.00, "количество в упаковке": 1000.00, "цена за единицу": 0.57},
    "Сикао темный": {"ед. измерения": "г", "цена за упаковку": 567.00, "количество в упаковке": 1000.00, "цена за единицу": 0.57},
    "Молоко": {"ед. измерения": "мл", "цена за упаковку": 70.00, "количество в упаковке": 950.00, "цена за единицу": 0.07},
    "Глазурь": {"ед. измерения": "г", "цена за упаковку": 311.00, "количество в упаковке": 1000.00, "цена за единицу": 0.31},
    "Шантипак": {"ед. измерения": "мл", "цена за упаковку": 250.00, "количество в упаковке": 900.00, "цена за единицу": 0.28},
    "Крахмал": {"ед. измерения": "г", "цена за упаковку": 950.00, "количество в упаковке": 1000.00, "цена за единицу": 0.10},
    "Лепестки миндальные": {"ед. измерения": "г", "цена за упаковку": 1239.00, "количество в упаковке": 1000.00, "цена за единицу": 1.24},
    "Мука": {"ед. измерения": "г", "цена за упаковку": 700.00, "количество в упаковке": 2000.00, "цена за единицу": 0.04},
    "Масло сливочное": {"ед. измерения": "г", "цена за упаковку": 314.00, "количество в упаковке": 400.00, "цена за единицу": 0.79},
    "Масло растительное": {"ед. измерения": "г", "цена за упаковку": 110.00, "количество в упаковке": 990.00, "цена за единицу": 0.11},
    "Йогурт": {"ед. измерения": "г", "цена за упаковку": 56.00, "количество в упаковке": 300.00, "цена за единицу": 0.19},
    "Сахарозаменитель": {"ед. измерения": "г", "цена за упаковку": 216.00, "количество в упаковке": 140.00, "цена за единицу": 1.54},
    "Сгущенка вареная": {"ед. измерения": "г", "цена за упаковку": 805.00, "количество в упаковке": 3500.00, "цена за единицу": 0.23},
    "Яйца": {"ед. измерения": "шт", "цена за упаковку": 350.00, "количество в упаковке": 30.00, "цена за единицу": 12.63},
    "Сливки": {"ед. измерения": "мл", "цена за упаковку": 410.00, "количество в упаковке": 900.00, "цена за единицу": 0.37},
    "Сыр кулинарный": {"ед. измерения": "г", "цена за упаковку": 1323.00, "количество в упаковке": 2200.00, "цена за единицу": 0.60},
    "Пудра": {"ед. измерения": "г", "цена за упаковку": 143.00, "количество в упаковке": 1000.00, "цена за единицу": 0.14},
    "Сахар": {"ед. измерения": "г", "цена за упаковку": 294.00, "количество в упаковке": 5000.00, "цена за единицу": 0.06},
    "Молоко кокосовое": {"ед. измерения": "мл", "цена за упаковку": 220.00, "количество в упаковке": 1000.00, "цена за единицу": 0.22},
    "Молоко миндальное": {"ед. измерения": "мл", "цена за упаковку": 220.00, "количество в упаковке": 1000.00, "цена за единицу": 0.22},
    "Соль": {"ед. измерения": "г", "цена за упаковку": 15.00, "количество в упаковке": 1000.00, "цена за единицу": 0.02},
    "Шоколад белый": {"ед. измерения": "г", "цена за упаковку": 730.00, "количество в упаковке": 1000.00, "цена за единицу": 0.81},
    "Разрыхлитель": {"ед. измерения": "г", "цена за упаковку": 8.00, "количество в упаковке": 15.00, "цена за единицу": 0.53},
    "Молоко сухое": {"ед. измерения": "г", "цена за упаковку": 300.00, "количество в упаковке": 1000.00, "цена за единицу": 0.30},
    "Клубника см": {"ед. измерения": "г", "цена за упаковку": 163.00, "количество в упаковке": 1000.00, "цена за единицу": 0.25},
    "Сыр милетто": {"ед. измерения": "г", "цена за упаковку": 1735.00, "количество в упаковке": 3200.00, "цена за единицу": 0.54},
    "Какао": {"ед. измерения": "г", "цена за упаковку": 580.00, "количество в упаковке": 1000.00, "цена за единицу": 0.58},
    "Вишня см": {"ед. измерения": "г", "цена за упаковку": 300.00, "количество в упаковке": 1000.00, "цена за единицу": 0.30},
    "Стружка кокосовая": {"ед. измерения": "г", "цена за упаковку": 260.00, "количество в упаковке": 1000.00, "цена за единицу": 0.23},
    "Крошка вафельная": {"ед. измерения": "г", "цена за упаковку": 368.00, "количество в упаковке": 300.00, "цена за единицу": 1.23},
    "Миндаль": {"ед. измерения": "г", "цена за упаковку": 300.00, "количество в упаковке": 300.00, "цена за единицу": 1.00},
    "Сгущенка белая": {"ед. измерения": "мл", "цена за упаковку": 56.00, "количество в упаковке": 200.00, "цена за единицу": 0.28},
    "Фундук": {"ед. измерения": "г", "цена за упаковку": 820.00, "количество в упаковке": 1000.00, "цена за единицу": 0.82},
    "Мед": {"ед. измерения": "г", "цена за упаковку": 140.00, "количество в упаковке": 500.00, "цена за единицу": 0.28},
    "Бананы": {"ед. измерения": "г", "цена за упаковку": 124.00, "количество в упаковке": 1000.00, "цена за единицу": 0.12},
    "Орех грецкий": {"ед. измерения": "г", "цена за упаковку": 115.00, "количество в упаковке": 150.00, "цена за единицу": 0.77},
    "Паста арахисовая": {"ед. измерения": "г", "цена за упаковку": 200.00, "количество в упаковке": 300.00, "цена за единицу": 0.67},
    "Малина см": {"ед. измерения": "г", "цена за упаковку": 353.00, "количество в упаковке": 1000.00, "цена за единицу": 0.41},
    "Манго пюре": {"ед. измерения": "г", "цена за упаковку": 850.00, "количество в упаковке": 1000.00, "цена за единицу": 0.85},
}

# Рассчитываем цену за единицу для каждого продукта
for product, details in products.items():
    details["цена за единицу"] = details["цена за упаковку"] / details["количество в упаковке"]

# Выводим таблицу
print("+---------------------+------------+------------------+---------------------+---------------+")
print("| Продукт             | Ед. изм.   | Цена за упаковку | Кол-во в упаковке   | Цена за ед.   |")
print("+---------------------+------------+------------------+---------------------+---------------+")
for product, details in products.items():
    print(f"| {product: <20} | {details['ед. измерения']: <10} | {details['цена за упаковку']: <16.2f} | {details['количество в упаковке']: <18.2f} | {details['цена за единицу']: <13.2f} |")
print("+---------------------+------------+------------------+---------------------+---------------+")


# In[3]:


intermediate_products = {
    "Ванильный бисквит Макс": {
        "количество порций": 25,
        "Ингредиенты": {
            "Яйца": 8,
            "Сахар": 340,
            "Мука": 340,
            "Разрыхлитель": 20,
            "Соль": 4,
            "Масло растительное": 60
        }
    },
    "Шоколадный бисквит Макс": {
        "количество порций": 25,
        "Ингредиенты": {
            "Яйца": 8,
            "Сахар": 335,
            "Какао": 70,
            "Мука": 270,
            "Разрыхлитель": 20,
            "Соль": 4,
            "Масло растительное": 60
        }
    },
    "Миндально-клубничный крем": {
        "количество порций": 10,
        "Ингредиенты": {
            "Молоко миндальное": 450,
            "Яйца": 2,
            "Сахарозаменитель": 10,
            "Шоколад белый": 50,
            "Крахмал": 45,
            "Йогурт": 165,
            "Шантипак": 235,
            "Сливки": 215,
            "Молоко сухое": 40,
            "Молоко": 200
        }
    },
    "Клубничная начинка": {
        "количество порций": 10,
        "Ингредиенты": {
            "Клубника см": 325,
            "Сахар": 35,
            "Крахмал": 15
        }
    },
    "Крем тирамису": {
        "количество порций": 7,
        "Ингредиенты": {
            "Сыр милетто": 410,
            "Сливки": 260,
            "Йогурт": 165,
            "Сахарозаменитель": 80,
            "Кофе": 20
        }
    },
    "Крем Рафаэлло": {
        "количество порций": 8,
        "Ингредиенты": {
            "Яйца": 2,
            "Сахар": 70,
            "Крахмал": 40,
            "Молоко кокосовое": 400,
            "Сгущенка белая": 35,
            "Стружка кокосовая": 45,
            "Шоколад белый": 50,
            "Шантипак": 220,
            "Сливки": 180,
            "Миндаль": 5,
            "Лепестки миндальные": 10,
            "Крошка вафельная": 5,
            "Молоко": 200
        }
    },
    "Баунти": {
        "количество порций": 8,
        "Цена за единицу": 5.10,
        "Ингредиенты": {
            "Яйца": 2,
            "Сахар": 70,
            "Крахмал": 40,
            "Молоко кокосовое": 400,
            "Сгущенка белая": 45,
            "Стружка кокосовая": 45,
            "Масло сливочное": 50,
            "Шантипак": 180,
            "Сливки": 165,
            "Сикао молочный": 165,
            "Молоко": 200
        }
    },
    "Ферреро": {
        "количество порций": 6,
        "Ингредиенты": {
            "Сыр милетто": 335,
            "Сливки": 255,
            "Какао": 40,
            "Пудра": 100,
            "Сикао молочный": 135,
            "Сливки": 125,
            "Фундук": 40,
            "Молоко": 200
        }
    },
    "Шоколадно-банановый": {
        "количество порций": 6,
        "Ингредиенты": {
            "Бананы": 252,
            "Йогурт": 165,
            "Сливки": 200,
            "Шантипак": 60,
            "Какао": 70,
            "Сахарозаменитель": 6,
            "Молоко": 200,
            "Сикао темный": 70,
            "Орех грецкий": 70
        }
    },
    "Милки Вэй": {
        "количество порций": 6,
        "Ингредиенты": {
            "Сыр милетто": 455,
            "Сливки": 370,
            "Молоко сухое": 40,
            "Пудра": 60,
            "Шоколад белый": 135,
            "Лепестки миндальные": 20,
            "Сгущенка белая": 10,
            "Молоко": 200,
            "Сикао молочный": 10
        }
    },
    "Молочный ломтик": {
        "количество порций": 6,
        "Ингредиенты": {
            "Сыр милетто": 455,
            "Сливки": 360,
            "Сгущенка белая": 80,
            "Молоко": 200,
            "Мед": 10,
            "Сикао молочный": 110
        }
    },
    "Нутелла": {
        "количество порций": 6,
        "Ингредиенты": {
            "Сыр милетто": 555,
            "Сливки": 305,
            "Какао": 45,
            "Пудра": 90,
            "Паста арахисовая": 100,
            "Орех грецкий": 30,
            "Молоко": 200,
            "Сахар": 10
        }
    },
    "Чизкейк": {
        "количество порций": 5,
        "Ингредиенты": {
            "Сыр милетто": 600,
            "Сливки": 100,
            "Пудра": 60,
            "Желатин": 15
        }
    },
    "Шоколадно-кофейный": {
        "количество порций": 5,
        "Ингредиенты": {
            "Сыр милетто": 600,
            "Сливки": 225,
            "Сикао молочный": 215,
            "Кофе": 14,
            "Пудра": 60,
            "Желатин": 15
        }
    },
    "Вишневая начинка": {
        "количество порций": 10,
        "Ингредиенты": {
            "Вишня см": 325,
            "Сахар": 35,
            "Крахмал": 15
        }
    },
    "Манго начинка": {
        "количество порций": 6,
        "Ингредиенты": {
            "Манго пюре": 240,
            "Желатин": 6
        }
    },
    "Ягодная начинка": {
        "количество порций": 6,
        "Ингредиенты": {
            "Клубника см": 100,
            "Вишня см": 100,
            "Малина см": 40,
            "Желатин": 6,
            "Сахар": 25
        }
    },
    "Дабл шоколад": {
        "количество порций": 8,
        "Ингредиенты": {
            "Молоко": 610,
            "Яйца": 2,
            "Какао": 60,
            "Крахмал": 30,
            "Сахарозаменитель": 10,
            "Молоко сухое": 30,
            "Сикао молочный": 60,
            "Сливки": 200,
            "Шантипак": 200,
            "Йогурт": 160,
            "Фундук": 10
        }
    },
    "Трубочка": {
        "количество порций": 20,
        "Ингредиенты": {
            "Яйца": 8,
            "Сахар": 300,
            "Мука": 240, 
            "Масло сливочное": 360,
            "Сгущенка вареная": 1280
        }
    },
    "Меренговый": {
        "количество порций": 1,  # Уточните количество порций, если необходимо
        "Ингредиенты": {
            "Яйца": 12,
            "Крахмал": 80,
            "Сливки": 250,
            "Пудра": 40,
            "Шантипак": 250,
            "Сахар": 650,
            "Малина см": 400,
            "Лепестки миндальные": 20
        }
    },
}

# Создаем словарь с ценами за единицу продуктов из таблицы products
#product_prices = {product_name: details.get("цена за единицу", 0) for product_name, details in products.items()}

# Рассчитываем цену за единицу полуфабриката
for product, details in intermediate_products.items():
    total_cost = 0
    for ing, qty in details["Ингредиенты"].items():
        ingredient_cost = qty * products.get(ing, {"цена за упаковку": 0})["цена за упаковку"] / products.get(ing, {"количество в упаковке": 1})["количество в упаковке"]
        total_cost += ingredient_cost
    details["Цена за единицу"] = total_cost / details["количество порций"]

# Вывод таблицы с полуфабрикатами
for product, details in intermediate_products.items():
    print(f"Полуфабрикат: {product}")
    print("+-------------------+------------------+")
    print("| Ингредиент        | Граммовка        |")
    print("+-------------------+------------------+")
    for ing, qty in details["Ингредиенты"].items():
        print(f"| {ing: <17} | {qty: <16} |")
    print(f"Количество порций: {details['количество порций']} | Цена за единицу: {details['Цена за единицу']:.2f}\n")


# In[4]:


# Добавление клубничной начинки в рецепт
desserts = {
    "Трайфл миндально-клубничный": {
        "Полуфабрикаты": {
            "Ванильный бисквит Макс": 1,
            "Миндально-клубничный крем": 1,
            "Клубничная начинка": 1  # Добавляем клубничную начинку
        }
    },
    "Трайфл тирамису": {
        "Полуфабрикаты": {
            "Ванильный бисквит Макс": 1,
            "Крем тирамису": 1
        }
    },
    "Трайфл рафаэлло": {
        "Полуфабрикаты": {
            "Крем Рафаэлло": 1,
            "Ванильный бисквит Макс": 1
        }
    },
    "Трайфл баунти": {
        "Полуфабрикаты": {
            "Баунти": 1,
            "Ванильный бисквит Макс": 1
        }
    },
    "Трайфл с Ферреро": {
        "Полуфабрикаты": {
            "Ферреро": 1,
            "Шоколадный бисквит Макс": 1
        }
    },
    "Трайфл шоколадно-банановый": {
        "Полуфабрикаты": {
            "Шоколадно-банановый": 1,
            "Шоколадный бисквит Макс": 1
        }
    },
    "Трайфл Милки Вэй": {
        "Полуфабрикаты": {
            "Милки Вэй": 1,
            "Ванильный бисквит Макс": 1
        }
    },
    "Трайфл молочный ломтик": {
        "Полуфабрикаты": {
            "Молочный ломтик": 1,
            "Шоколадный бисквит Макс": 1
        }
    },
    "Трайфл миндально-вишневый": {
        "Полуфабрикаты": {
            "Миндально-клубничный крем": 1,
            "Вишневая начинка": 1,
            "Шоколадный бисквит Макс": 1
        }
    },
    "Трайфл Дабл шоколад": {
        "Полуфабрикаты": {
            "Дабл шоколад": 1,
            "Шоколадный бисквит Макс": 1
        }
    },
    "Трайфл Нутелла": {
        "Полуфабрикаты": {
            "Нутелла": 1,
            "Шоколадный бисквит Макс": 1
        }
    },
    "Трайфл Чизкейк ягодный": {
        "Полуфабрикаты": {
            "Чизкейк": 1,
            "Ягодная начинка": 1,
            "Ванильный бисквит Макс": 0.5
        }
    },
    "Трайфл Чизкейк манго": {
        "Полуфабрикаты": {
            "Чизкейк": 1,
            "Манго начинка": 1,
            "Шоколадный бисквит Макс": 0.5
        }
    },
    "Трайфл Чизкейк шоколадно-кофейный": {
        "Полуфабрикаты": {
            "Шоколадно-кофейный": 1,
            "Шоколадный бисквит Макс": 0.5
        }
    },
}
# Подсчет стоимости десерта Трайфл
dessert_prices = {}
for dessert, details in desserts.items():
    print(f"Десерт: {dessert}")
    print("+---------------------+------------+")
    print("| Полуфабрикат        | Количество |")
    print("+---------------------+------------+")
    total_cost = 0
    for intermediate_product, quantity in details["Полуфабрикаты"].items():
        # Получаем цену за единицу полуфабриката
        cost_per_unit = intermediate_products[intermediate_product]["Цена за единицу"]
        # Учитываем только стоимость одной порции полуфабриката
        component_cost = quantity * cost_per_unit
        total_cost += component_cost
        print(f"| {intermediate_product: <20} | {quantity: <10} |")
    print("+---------------------+------------+")
    print(f"Стоимость десерта: {total_cost:.2f}\n")
    dessert_prices[dessert] = total_cost
    
total_dessert_cost = sum(dessert_prices.values())
average_dessert_cost = total_dessert_cost / len(dessert_prices)

print(f"Средняя стоимость десерта: {average_dessert_cost:.2f}")


# In[5]:


pip install --upgrade werkzeug


# In[16]:


# Create a new virtual environment
get_ipython().system('python -m venv myenv')

# Activate the virtual environment
get_ipython().system('myenv\\Scripts\\activate')

# Install the required libraries
get_ipython().system('pip install dash werkzeug')

python app.py


# In[15]:


import dash
from dash import dcc, html
from dash.dependencies import Input, Output
import pandas as pd

# Ваши данные
intermediate_products = {
    "Ванильный бисквит Макс": {
        "количество порций": 25,
        "Ингредиенты": {
            "Яйца": 8,
            "Сахар": 340,
            "Мука": 340,
            "Разрыхлитель": 20,
            "Соль": 4,
            "Масло растительное": 60
        }
    },
    # Добавьте остальные полуфабрикаты
}

# Создаем Dash-приложение
app = dash.Dash(__name__)

# Определяем макет приложения
app.layout = html.Div(children=[
    html.H4(children='Таблица полуфабрикатов'),
    dcc.Graph(
        id='intermediate-products-table',
        figure={
            'data': [{
                'x': intermediate_products.keys(),
                'y': [item['количество порций'] for item in intermediate_products.values()],
                'type': 'bar',
                'name': 'Количество порций',
            }],
            'layout': {
                'title': 'Количество порций полуфабрикатов'
            }
        }
    ),
])

if __name__ == '__main__':
    app.run_server(debug=True)


# In[ ]:




